# -*- coding:utf-8 -*-
'''
@author:oldwai
'''

# email: frankandrew@163.com
"""
显示颜色格式：\033[显示方式;字体色;背景色m......[\033[0m]
-------------------------------------------
字体色     |       背景色     |      颜色描述
-------------------------------------------
30        |        40       |       黑色
31        |        41       |       红色
32        |        42       |       绿色
33        |        43       |       黃色
34        |        44       |       蓝色
35        |        45       |       紫红色
36        |        46       |       青蓝色
37        |        47       |       白色
-------------------------------
显示方式     |      效果
-------------------------------
0           |     终端默认设置
1           |     高亮显示
4           |     使用下划线
5           |     闪烁
7           |     反白显示
8           |     不可见
-------------------------------
"""

#输了显示红色  红色字体31
#赢了显示绿色  绿色字体32
#平局显示白色  白色字体37
# 数字1 表示高亮
import random


while 1:
    s = int(random.randint(1, 3))

    if s == 1:
        ind = "石头"
    elif s == 2:
        ind = "剪刀"
    elif s == 3:
        ind = "布"
    print(ind)
    m = input('输入 \033[1;34;0m 石头、剪刀、布\033[0m,输入"end"结束游戏:')
    blist = ['石头', "剪刀", "布"]
    if (m not in blist) and (m != 'end'):
        print("输入错误，请重新输入！")

    elif (m not in blist) and (m == 'end'):
        print("'\033[1;94m'+\n游戏退出中...\033[0m")
        break

    elif m == ind :
        print('\033[1;34;0m'+"电脑出了： " + ind + "，平局！"+'\033[0m')

    elif (m == '石头' and ind =='剪刀') or (m == '剪刀' and ind =='布') or (m == '布' and ind =='石头'):
        print('\033[1;31;0m'+"电脑出了： " + ind +"，你赢了！"+'\033[0m')

    elif (m == '石头' and ind =='布') or (m == '剪刀' and ind =='石头') or (m == '布' and ind =='剪刀'):
        print('\033[1;32;0m'+"电脑出了： " + ind +"，你输了！"+'\033[0m')